In [113]:
import numpy as np
import pandas as pd

In [114]:
dict1 = { "Isim": [ "Irem","Sena","Selma","Ismail"],
                 "Spor":["Koşu","Yuzme","Koşu","Basketball"],
                 "Kalori":[100,200,300,400]
        }

In [115]:
dataFrame1 = pd.DataFrame(dict1,index=[0,1,2,3])

In [116]:
dataFrame1

     Isim        Spor  Kalori
0    Irem        Koşu     100
1    Sena       Yuzme     200
2   Selma        Koşu     300
3  Ismail  Basketball     400

In [117]:
dict2 = { "Isim": [ "Zeynep","Leyla","Esra","Mustafa"],
                 "Spor":["Koşu","Yuzme","Koşu","Basketball"],
                 "Kalori":[200,600,500,50]
        }

In [118]:
dataFrame2 = pd.DataFrame(dict2,index=[4,5,6,7])

In [119]:
dict3 = { "Isim": [ "Fikri","Sultan","Şukriye","Murat"],
                 "Spor":["Koşu","Yuzme","Badminton","Tenis"],
                 "Kalori":[70,150,400,200]
        }

In [120]:
dataFrame3 = pd.DataFrame(dict3,index=[8,9,10,11])

In [121]:
dataFrame2

      Isim        Spor  Kalori
4   Zeynep        Koşu     200
5    Leyla       Yuzme     600
6     Esra        Koşu     500
7  Mustafa  Basketball      50

In [122]:
dataFrame2

      Isim        Spor  Kalori
4   Zeynep        Koşu     200
5    Leyla       Yuzme     600
6     Esra        Koşu     500
7  Mustafa  Basketball      50

## Concatenation

In [123]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

       Isim        Spor  Kalori
0      Irem        Koşu     100
1      Sena       Yuzme     200
2     Selma        Koşu     300
3    Ismail  Basketball     400
4    Zeynep        Koşu     200
5     Leyla       Yuzme     600
6      Esra        Koşu     500
7   Mustafa  Basketball      50
8     Fikri        Koşu      70
9    Sultan       Yuzme     150
10  Şukriye   Badminton     400
11    Murat       Tenis     200

## Merge

In [124]:
mergeDict1 = {"Isim" : ["Irem","Sena","Selma","Ismail"],
                         "Spor" : ["Koşu","Yuzme","Koşu","Basketball"]
                         }

In [125]:
mergeDataFrame1 = pd.DataFrame(mergeDict1)

In [126]:
mergeDataFrame1

     Isim        Spor
0    Irem        Koşu
1    Sena       Yuzme
2   Selma        Koşu
3  Ismail  Basketball

In [127]:
mergeDict2 = {"Isim" : ["Irem","Sena","Selma","Ismail"],
                         "Kalori" : [100,200,150,250]
                         }

In [128]:
mergeDataFrame2 = pd.DataFrame(mergeDict2)

In [129]:
mergeDataFrame2

     Isim  Kalori
0    Irem     100
1    Sena     200
2   Selma     150
3  Ismail     250

In [130]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim        Spor  Kalori
0    Irem        Koşu     100
1    Sena       Yuzme     200
2   Selma        Koşu     150
3  Ismail  Basketball     250

In [131]:
maasDict = {"Isim": ["Irem","Sena","Ismail","Selma"],
                       "Departman": ["Yazılım","Satis","Pazarlama","Yazılım"],
                        "Maas" : [ 1000,2000,3000,4000]
                    }

In [132]:
maasDataFrame = pd.DataFrame(maasDict)

In [133]:
maasDataFrame

     Isim  Departman  Maas
0    Irem    Yazılım  1000
1    Sena      Satis  2000
2  Ismail  Pazarlama  3000
3   Selma    Yazılım  4000

In [134]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satis', 'Pazarlama'], dtype=object)

In [135]:
maasDataFrame["Departman"].nunique()

3

In [136]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Pazarlama    1
Satis        1
Name: Departman, dtype: int64

In [137]:
def brutToNet(maas):
    return maas*0.66

In [138]:
maasDataFrame["Maas"].apply(brutToNet) #foksiyonlari uygulamak için apply methodu kullanılır

0     660.0
1    1320.0
2    1980.0
3    2640.0
Name: Maas, dtype: float64

In [139]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [140]:
newData = { "Karakter Sınıfı":["South Park","South Park","Simpson","Simpson"],
                      "Karakter Ismi":["Cartman","Kenny","Homer","Bart"],
                       "Karakter Yas":[9,10,50,20]
                      }

In [141]:
karakterDf = pd.DataFrame(newData)

In [142]:
karakterDf

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [143]:
karakterDf.pivot_table(values= "Karakter Yas", index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [148]:
newData1 = { "Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
                      "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
                       "Karakter Yas":[9,10,50,20,10]
                      }

In [149]:
karakterDf1 = pd.DataFrame(newData1)

In [150]:
karakterDf1

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [155]:
karakterDf1.pivot_table(values= "Karakter Yas", index=["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [157]:
## Barttan iki tane olduğu için değerlerinin ort aldı toplamını almasını istiyorsak aggfunc=np.sum methodunu kullanmalıyız